
INSERT INTO project(project_name, project_status, start_date, finish_date)
VALUES
    ('Создание маркетплейса', 'ACTIVE', '2023-12-16', '2024-04-06'),
    ('Продвижение продукта', 'ACTIVE', '2023-08-24', NULL),
    ('Повышение безопасности клиентов сервиса', 'ACTIVE', '2023-01-22', '2024-06-03'),
    ('Судебный процесс', 'NON_ACTIVE', '2023-06-22', '2023-11-20'),
    ('Предоставление услуг ООО «Восток»', 'NON_ACTIVE', '2022-07-01', '2022-09-20');

INSERT INTO payment_policy(policy_type, position, project_id, project_role, special_occasion, status, payment)
VALUES
('POSITION', 'Бухгалтер', NULL, NULL, NULL, 'ACTIVE', 30000),
('ROLE', NULL, 5, 'Связь с клиентом', NULL, 'ACTIVE', 20000),
('SPECIAL_OCCASION', NULL, NULL, NULL, 'Новый год', 'ACTIVE', 10000),
('POSITION', 'Программист', NULL, NULL, NULL, 'ACTIVE', 40000),
('POSITION', 'Hr-специалист', NULL, NULL, NULL, 'ACTIVE', 40000),
('ROLE', NULL, 4, 'Адвокат', NULL, 'ACTIVE', 50000),
('SPECIAL_OCCASION', NULL, NULL, NULL, 'Премия', 'ACTIVE', 15000),
('POSITION', 'Менеджер', NULL, NULL, NULL, 'ACTIVE', 40000),
('ROLE', NULL, 1, 'Старший программист', NULL, 'ACTIVE', 25000);

INSERT INTO employee(full_name, position, adress, date_of_birth, education, education_degree, phone_number, work_experience)
VALUES
    ('Белевцова Виктория Олеговна', 'Hr-специалист', 'Пролетарская ул., д. 23 кв.78', '1966-07-11', 'Российский государственный университет им. А.Н. Косыгина ', 'Бакалавр', '79778543449', 15),
    ('Кумпан Екатерина Николаевна', 'Бухгалтер', 'Совхозная ул., д. 13 кв.16', '1980-10-10', NULL, NULL, '7306800040', 2),
    ('Форисенков Илья Сергеевич', 'Программист', 'пр. Будапештсткая, 30', '1970-10-09', 'Северо-Кавказский федеральный университет', 'Магистр', '7846046107', 18),
    ('Нимерницкая Ирина Андреевна', 'Адвокат', 'Западная ул., д. 17 кв.144', '1981-02-04', 'Факультет финансов и банковского дела РАНХиГС', 'Бакалавр', '77797094982', 5),
    ('Окорокова Елена Владимировна', 'Бухгалтер', 'Калинина ул., д. 21 кв.176', '1992-06-13', NULL, NULL, '71485101443', 8),
    ('Стержаков Андрей Михайлович', 'Программист', 'Якуба Коласа ул., д. 11 кв.130', '1974-04-01', 'Северо-Кавказский федеральный университет', 'Бакалавр', '74797093449', 22),
    ('Кизин Михаил Михайлович', 'Программист', 'Новый пер., д. 16 кв.139', '1973-07-15', 'Московский государственный технологический университет СТАНКИН', 'Магистр', '78297458520', 21),
    ('Романова Елена Васильевна', 'Менеджер', 'Школьная ул., д. 16 кв.169', '1997-01-22', 'Инженерно-экономический институт НИУ «МЭИ»', 'Бакалавр', '78322220213', 0),
    ('Маклыгина Екатерина Константиновна', 'Бухгалтер', 'Победы ул., д. 19 кв.215', '1989-01-04', 'Северо-Кавказский федеральный университет', 'Бакалавр', '7449583368', 13),
    ('Корбань Варвара Игорев', 'Менеджер', 'Центральная ул., д. 13 кв.19', '1973-07-22', 'Северо-Кавказский федеральный университет', 'Магистр', '74908933664', 30);





INSERT INTO assign_to_project(employee_id, project_id, project_role, assign_status, start_date, finish_date)
VALUES
    (1, 2, 'Связь с клиентом', 'NON_ACTIVE', '2022-07-01 ', '2022-09-20'),
    (4, 4, 'Адвокат', 'ACTIVE', '2023-06-22', '2023-11-20'),
    (6, 1, 'Старший программист', 'ACTIVE', '2023-12-20', NULL);

INSERT INTO assign_payment(employee_id, policy_id, payment, payment_date)
VALUES
    (9, 1, 30000, '2000-03-23'),
    (4, 6, 50000, '2023-06-22'),
    (1, 5, 40000, '2003-08-21'),
    (8, 8, 30000, '2023-12-03'),
    (7, 3, 8000, '2002-12-15'),
    (7, 4, 40000, '2000-03-12'),
    (1, 2, 20000, '2022-07-01 '),
    (2, 1, 30000, '2007-06-05'),
    (3, 4, 40000, '2016-09-09'),
    (6, 9, 25000, '2023-12-16 ');